---
kind: type
id: T:Autodesk.Revit.DB.FilterStringEndsWith
source: html/ee1100a1-4ae0-089a-4bec-fc0afbdf958b.htm
---
# Autodesk.Revit.DB.FilterStringEndsWith

Tests whether string values from the document end with a certain string.

## Syntax (C#)
```csharp
public class FilterStringEndsWith : FilterStringRuleEvaluator
```

## Remarks
All string comparisons in this class are performed in the case-insensitive manner.